In [3]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [5]:
df = pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [6]:
# We can grab the oclumn names with .columns
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [7]:
#We can retrieve rows through indexing
df.ix[3]

/home/abhinandan/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

User ID            15603246
Gender               Female
Age                      27
EstimatedSalary       57000
Purchased                 0
Name: 3, dtype: object

In [8]:
#We can also assign values to entire columns
df['New_column']="New Value"

In [9]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased New_column
0  15624510    Male   19            19000          0  New Value
1  15810944    Male   35            20000          0  New Value
2  15668575  Female   26            43000          0  New Value
3  15603246  Female   27            57000          0  New Value
4  15804002    Male   19            76000          0  New Value

In [10]:
#We can also delete columns
del df['New_column']

df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [11]:
#DataFrames can be constructed from a dictionary of equal length lists
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

city_frame = DataFrame(data)
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000